MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash_itf.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_flash_itf.c
  * @brief   This file provides FLASH ITF peripheral services.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"


/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined (FLASH)
#if defined (USE_HAL_FLASH_MODULE) && (USE_HAL_FLASH_MODULE == 1)

/** @addtogroup FLASH_ITF
  * @{
  */

/** @defgroup FLASH_ITF_Introduction FLASH_ITF Introduction
  * @{

  The FLASH ITF Hardware Abstraction Layer (HAL) provides high-level, user-friendly interface APIs for managing
  non-volatile memory (FLASH) configuration and control on STM32 microcontrollers.

  This layer offers firmware functions to support key FLASH interface functionalities, including:

   - Lock and unlock management.
   - Control operations.
   - Privilege attributes.
   - Option byte configuration.
   - Option byte process interrupt handling.

  The abstraction provided by this layer ensures portability and simplifies application development
  across various STM32 microcontroller series.

  */
/**
  * @}
  */

/** @defgroup FLASH_ITF_How_To_Use FLASH ITF How To Use
  * @{
This file provides firmware functions to manage the following functionalities of the FLASH option bytes peripheral:

- Lock and unlock functions
- Configuration functions
- Launch functions

# FLASH option bytes main features

- The FLASH option bytes, often referred to as "Option Bytes" or "OB" in the context of microcontrollers, are a set of
  configuration settings that can be programmed to customize the behavior of the flash memory and other features of a
  microcontroller. These Option Bytes are typically stored in a special area of the flash memory and are used to control
  various aspects of the device's operation.

## Lock mechanism:

  - After reset, the FLASH option bytes are write-protected.
    Use the unlock sequence to run any operation on the FLASH option bytes.

## Option bytes:

  - Write protection area: The user area in flash memory can be protected against unwanted write operations.
                           Each block of up to 2 pages can be individually write-protected.

  - Read-out protection: The read-out protection protects the flash main memory, the option bytes, the backup
                         registers, the backup RAM and the SRAM to reach the highest level of security.
                         - 3 levels (L0, L2_wBS and L2) of protection available.
                         - It is mandatory to set a password OEM key for regression to L0 from L2_wBS and L2 levels.

  - Hide protection area: A part of the main flash memory area.

  - Boot lock: Several option bytes cannot be modified when the boot lock mechanism is enabled.

  - Boot address: The boot address option bytes are used to program a boot address in USER FLASH.

  - User option bytes: Option bytes include additional options to customize the behavior.
                       - Reset generation in low power mode, erase memories upon system reset, watchdog selection,
                         Independent watchdog counter freeze, Bank swapping, Single/Dual bank, SRAM ECC, Boot0,
                         Boot selection, EDATA area, Bootloader Interface.

# How to use the FLASH_ITF HAL module driver

## Lock and unlock functions:

- Use the HAL_FLASH_ITF_Lock() and HAL_FLASH_ITF_Unlock() functions to lock and unlock the access to the FLASH control
  register.
- Use the HAL_FLASH_ITF_IsLocked() function to check the lock access state to the FLASH control register.

## Configuration functions:

- Use the HAL_FLASH_ITF_SetLatency() function to set the FLASH latency.
- Use the HAL_FLASH_ITF_GetLatency() function to get the FLASH latency.
- Use the HAL_FLASH_ITF_SetProgrammingDelay() function to set the FLASH programming delay.
- Use the HAL_FLASH_ITF_GetProgrammingDelay() function to get the FLASH programming delay.
- Use the HAL_FLASH_ITF_EnablePrefetch() function to enable the FLASH prefetch.
- Use the HAL_FLASH_ITF_DisablePrefetch() function to disable the FLASH prefetch.
- Use the HAL_FLASH_ITF_IsEnabledPrefetch() function to check if the FLASH prefetch is enabled or disabled.
- Use the HAL_FLASH_ITF_SetEmptyBootLocation() function to set the FLASH empty boot location information.
- Use the HAL_FLASH_ITF_GetEmptyBootLocation() function to get the FLASH empty boot location information.
- Use the HAL_FLASH_ITF_SetHDPExtArea() function to set the HDP extended area.
- Use the HAL_FLASH_ITF_GetHDPExtArea() function to get the HDP extended area.
- Use the HAL_FLASH_ITF_IsLockedRDPOEMKey() function to check if the RDP OEM key is locked or unlocked.
- Use the HAL_FLASH_ITF_IsLockedRDPBSKey() function to check if the RDP BS key is locked or unlocked.
- Use the HAL_FLASH_ITF_ECC_EnableIT() function to enable the FLASH ECC interrupt.
- Use the HAL_FLASH_ITF_ECC_DisableIT() function to disable the FLASH ECC interrupt.
- Use the HAL_FLASH_ITF_ECC_IsEnabledIT() function to check if the FLASH ECC interrupt is enabled or disabled.

## Option bytes lock and unlock functions:

- Use the HAL_FLASH_ITF_OB_Lock() function to lock the access to the FLASH option bytes registers.
- Use the HAL_FLASH_ITF_OB_Unlock() function to unlock the access to the FLASH option bytes registers.
- Use the HAL_FLASH_ITF_OB_IsLocked() function to check the lock state of the access to the FLASH option bytes
  registers.

## Option bytes OTP lock and unlock functions:

- Use the HAL_FLASH_ITF_OB_LockOTPBlock() function to lock the selected OTP blocks.
- Use the HAL_FLASH_ITF_OB_IsLockedOTPBlock() function to check whether a selected OTP block is locked.

## EDATA Area configuration:
- Use the HAL_FLASH_ITF_OB_EnableEDATAArea() function to enable the EDATA area.
- Use the HAL_FLASH_ITF_OB_DisableEDATAArea() function to disable the EDATA area.
- Use the HAL_FLASH_ITF_OB_IsEnabledEDATAArea() function to check if the EDATA area is enabled or disabled.

## Write protection area configuration:

- Use the HAL_FLASH_ITF_OB_EnablePageWRP() function to enable the FLASH ITF OB pagewise write protection area
  configuration.
- Use the HAL_FLASH_ITF_OB_DisablePageWRP() function to disable the FLASH ITF OB pagewise write protection area
  configuration.
- Use the HAL_FLASH_ITF_OB_IsEnabledPageWRP() function to check if the FLASH ITF OB pagewise write protection area
  configuration is enabled or disabled.

## Hide protection configuration:

- Use the HAL_FLASH_ITF_OB_SetHDPArea() function to set the FLASH ITF OB hide protection area configuration.
- Use the HAL_FLASH_ITF_OB_GetHDPArea() function to get the FLASH ITF OB hide protection area configuration.

