MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash_itf.c
## Read-out protection configuration:

- Use the HAL_FLASH_ITF_OB_SetRDPLevel() function to set the FLASH ITF OB read-out protection level.
- Use the HAL_FLASH_ITF_OB_GetRDPLevel() function to get the FLASH ITF OB read-out protection level.
- Use the HAL_FLASH_ITF_OB_SetRDPOEMKey() function to set the FLASH ITF OB read-out protection OEM key.
- Use the HAL_FLASH_ITF_OB_SetRDPBSKey() function to set the FLASH ITF OB read-out protection BS key.

## Enter low power modes by reset generation configuration:

- Use the HAL_FLASH_ITF_OB_SetEnterLowPWRModeRstGeneration() function to set the FLASH ITF OB enter stop mode,
  or standby mode reset generation configuration.
- Use the HAL_FLASH_ITF_OB_GetEnterLowPWRModeRstGeneration() function to get the FLASH ITF OB enter stop mode,
  or standby mode reset generation configuration.

## SRAM System reset erase configuration:

- Use the HAL_FLASH_ITF_OB_SetSystemRstSRAMErase() function to set the FLASH ITF OB system reset SRAM1 and SRAM2 erase
  configuration.
- Use the HAL_FLASH_ITF_OB_GetSystemRstSRAMErase() function to get the FLASH ITF OB system reset SRAM1 and SRAM2 erase
  configuration.

## WDG Mode configuration:

- Use the HAL_FLASH_ITF_OB_SetIWDGMode() function to set the FLASH ITF OB IWDG mode configuration.
- Use the HAL_FLASH_ITF_OB_GetIWDGMode() function to get the FLASH ITF OB IWDG mode configuration.
- Use the HAL_FLASH_ITF_OB_SetWWDGMode() function to set the FLASH ITF OB WWDG mode configuration.
- Use the HAL_FLASH_ITF_OB_GetWWDGMode() function to get the FLASH ITF OB WWDG mode configuration.

## WDG counter freeze configuration:

- Use the HAL_FLASH_ITF_OB_FreezeIWDGCounterLowPWRMode() function to freeze the FLASH ITF OB IWDG for stop and standby
  counter configuration.
- Use the HAL_FLASH_ITF_OB_UnfreezeIWDGCounterLowPWRMode() function to unfreeze the FLASH ITF OB IWDG stop and standby
  counter configuration.
- Use the HAL_FLASH_ITF_OB_IsFrozenIWDGCounterLowPWRMode() function to check the FLASH ITF OB IWDG stop and standby
  counter configuration is enabled.

## Bank swapping configuration:

- Use the HAL_FLASH_ITF_OB_SetBankSwap() function to set the FLASH ITF OB swap bank configuration.
- Use the HAL_FLASH_ITF_OB_GetBankSwap() function to get the FLASH ITF OB swap bank configuration.
- Use the HAL_FLASH_ITF_OB_IsBankSwapped() function to check the FLASH ITF OB swap bank.

## Bank configuration:

- Use the HAL_FLASH_ITF_OB_SetBankTopology() function to set the FLASH ITF OB single dual bank configuration.
- Use the HAL_FLASH_ITF_OB_GetBankTopology() function to get the FLASH ITF OB single dual bank configuration.

## SRAM ECC configuration:

- Use the HAL_FLASH_ITF_OB_EnableSRAMECC() function to enable the FLASH ITF OB for SRAM2 ECC configuration.
- Use the HAL_FLASH_ITF_OB_DisableSRAMECC() function to disable the FLASH ITF OB for SRAM2 ECC configuration.
- Use the HAL_FLASH_ITF_OB_IsEnabledSRAMECC() function to check the FLASH ITF OB for SRAM2 ECC configuration is enabled.

## Boot configuration:

- Use the HAL_FLASH_ITF_OB_SetBootSelection() function to set the FLASH ITF OB boot source selection.
- Use the HAL_FLASH_ITF_OB_GetBootSelection() function to get the FLASH ITF OB boot source selection.

- Use the HAL_FLASH_ITF_OB_SetBoot0() function to set the FLASH ITF OB boot0 configuration.
- Use the HAL_FLASH_ITF_OB_GetBoot0() function to get the FLASH ITF OB boot0 configuration.

- Use the HAL_FLASH_ITF_OB_SetBootAddr() function to set the FLASH OB boot address configuration.
- Use the HAL_FLASH_ITF_OB_GetBootAddr() function to get the FLASH OB boot address configuration.

- Use the HAL_FLASH_ITF_OB_LockBootConfig() function to lock the FLASH option bytes boot configuration.
- Use the HAL_FLASH_ITF_OB_UnlockBootConfig() function to unlock the FLASH option bytes boot configuration.
- Use the HAL_FLASH_ITF_OB_IsLockedBootConfig() function to check if the FLASH ITF OB boot configuration
  is locked or unlocked.

## Bootloader interface configuration:

- Use the HAL_FLASH_ITF_OB_SetBootloaderInterfaceConfig() function to set the bootloader interface configuration.
- Use the HAL_FLASH_ITF_OB_GetBootloaderInterfaceConfig() function to get the bootloader interface configuration.

## Option bytes programming function:

- Use the HAL_FLASH_ITF_OB_Program() function to program the option bytes in polling mode.
- Use the HAL_FLASH_ITF_OB_Program_IT() function to program the option bytes in interrupt mode.

## IRQHandler and Callback functions:

- Use the HAL_FLASH_ITF_IRQHandler() function to handle OB write/error operations.
- Use the HAL_FLASH_ITF_OB_ProgramCpltCallback() function to be redefined within application for the OB complete write
  operations callback.
- Use the HAL_FLASH_ITF_OB_ErrorCallback() function to be redefined within application for the OB write operation error
  callback.

## Privilege attributes management functions:

- Use the HAL_FLASH_ITF_SetPrivAttr() function to set the privilege attribute.
- Use the HAL_FLASH_ITF_GetPrivAttr() function to get the privilege attribute.
  */
/**
  * @}
  */

/** @defgroup FLASH_ITF_Configuration_Table FLASH ITF Configuration Table
  * @{
# Configuration inside the FLASH ITF driver

Configuration defines        | Description     | Default value   | Note                                              |
-----------------------------|-----------------|-----------------|---------------------------------------------------|
PRODUCT                      | from IDE        |        NA       | The selected device (ex STM32C5xx).               |
USE_HAL_FLASH_MODULE         | from hal_conf.h |        1        | Enables the HAL FLASH module.                     |
USE_ASSERT_DBG_PARAM         | from IDE        |      None       | Enables assert check parameters.                  |
  */
/**
  * @}
  */

/* Private Constants -------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_ITF_Private_Constants FLASH ITF Private Constants
  * @{
  */
#define FLASH_ITF_OB_TIMEOUT        1000U                                              /*!< FLASH default OB timeout */
#define FLASH_ITF_OB_LOW_PWR_MSK    (HAL_FLASH_ITF_OB_STOP_MODE      \
                                     | HAL_FLASH_ITF_OB_STANDBY_MODE)                  /*!< FLASH low power mask     */
#define FLASH_ITF_OB_SRAM_ERASE_MSK (HAL_FLASH_ITF_OB_SRAM2 | HAL_FLASH_ITF_OB_SRAM1)  /*!< FLASH SRAM erase mask    */
#define FLASH_ITF_OB_SRAM_ECC_MSK   (HAL_FLASH_ITF_OB_SRAM2)                           /*!< FLASH SRAM ecc mask      */
#define FLASH_ITF_OB_OTP_BLOCK_NBR  24U                                                /*!< FLASH OTP block number   */
/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_ITF_Private_Macros FLASH ITF Private Macros
  * @{
  */

