MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash_itf.c
/*! Macro to get the FLASH physical instance from the HAL instance */
#define FLASH_GET_ITF_INSTANCE(instance) ((FLASH_TypeDef *)((uint32_t)(instance)))

/*! Macro to check FLASH memory bank */
#define IS_FLASH_BANK(value) (((value) == HAL_FLASH_BANK_1) || ((value) == HAL_FLASH_BANK_2))

/*! Macro to get FLASH low-layer bank */
#define FLASH_GET_ITF_BANK(value) (((value) == HAL_FLASH_BANK_1) ? LL_FLASH_BANK_1 : LL_FLASH_BANK_2)

/*! Macro to check FLASH memory latency */
#define IS_FLASH_ITF_LATENCY(value) (((value) == HAL_FLASH_ITF_LATENCY_0)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_1)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_2)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_3)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_4)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_5)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_6)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_7)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_8)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_9)  \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_10) \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_11) \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_12) \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_13) \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_14) \
                                     || ((value) == HAL_FLASH_ITF_LATENCY_15))

/*! Macro to check FLASH memory programming delay */
#define IS_FLASH_ITF_PROGRAMMING_DELAY(value) (((value) == HAL_FLASH_ITF_PROGRAM_DELAY_0)  \
                                               || ((value) == HAL_FLASH_ITF_PROGRAM_DELAY_1)  \
                                               || ((value) == HAL_FLASH_ITF_PROGRAM_DELAY_2)  \
                                               || ((value) == HAL_FLASH_ITF_PROGRAM_DELAY_3))

/*! Macro to check FLASH empty boot location status */
#define IS_FLASH_ITF_EMPTY_BOOT_LOCATION(value) (((value) == HAL_FLASH_ITF_BOOT_LOCATION_PROGRAMMED) \
                                                 || ((value) == HAL_FLASH_ITF_BOOT_LOCATION_EMPTY))


#if defined (USE_HAL_FLASH_ECC) && (USE_HAL_FLASH_ECC == 1)
/*! Macro to check FLASH ECC interrupt */
#define IS_FLASH_ITF_ECC_INTERRUPT(value) ((value) == HAL_FLASH_ITF_IT_ECC_SINGLE)
#endif /* USE_HAL_FLASH_ECC */

/*! Macro to get the FLASH HDPExt bank */
#define FLASH_GET_HDPEXT_BANK(bank) (((bank) == HAL_FLASH_BANK_1) ? LL_FLASH_HDPEXT_BANK_1 : LL_FLASH_HDPEXT_BANK_2)

/*! Macro to check FLASH ITF OB Readout protection levels */
#define IS_FLASH_ITF_OB_RDP_LEVEL(value) (((value) == HAL_FLASH_ITF_OB_RDP_LEVEL_0)      \
                                          || ((value) == HAL_FLASH_ITF_OB_RDP_LEVEL_2_WBS) \
                                          || ((value) == HAL_FLASH_ITF_OB_RDP_LEVEL_2))

/*! Macro to check FLASH ITF OB low power mode */
#define IS_FLASH_ITF_OB_LOW_PWR_MODE(value) (((value) == HAL_FLASH_ITF_OB_STOP_MODE)    \
                                             || ((value) == HAL_FLASH_ITF_OB_STANDBY_MODE))

/*! Macro to check FLASH ITF OB low power reset generation */
#define IS_FLASH_ITF_OB_RST_GENERATION(value)(((value) == HAL_FLASH_ITF_OB_RST_GENERATION) \
                                              || ((value) == HAL_FLASH_ITF_OB_NO_RST_GENERATION))

/*! Macro to check FLASH ITF OB SRAM erase*/
#define IS_FLASH_ITF_OB_SRAM_ERASE(value) (((value) == HAL_FLASH_ITF_OB_SRAM2) \
                                           || ((value) == HAL_FLASH_ITF_OB_SRAM1))

/*! Macro to check FLASH ITF OB SRAM ecc*/
#define IS_FLASH_ITF_OB_SRAM_ECC(value) (((value) == HAL_FLASH_ITF_OB_SRAM2))

/*! Macro to check FLASH ITF OB system reset SRAM erase */
#define IS_FLASH_ITF_OB_SYSTEM_RST_SRAM_ERASE(value) (((value) == HAL_FLASH_ITF_OB_SYS_RST_SRAM_ERASE) \
                                                      || ((value) == HAL_FLASH_ITF_OB_SYS_RST_SRAM_NO_ERASE))

/*! Macro to check FLASH ITF OB wdg hardware/software mode */
#define IS_FLASH_ITF_OB_WDG_HW_SW_MODE(value) (((value) == HAL_FLASH_ITF_OB_WDG_HARDWARE) \
                                               || ((value) == HAL_FLASH_ITF_OB_WDG_SOFTWARE))

/*! Macro to check FLASH ITF OB single dual bank */
#define IS_FLASH_ITF_OB_SINGLE_DUAL_BANK(value) (((value) == HAL_FLASH_ITF_OB_SINGLE_BANK) \
                                                 || ((value) == HAL_FLASH_ITF_OB_DUAL_BANK))

/*! Macro to check FLASH ITF OB swap bank */
#define IS_FLASH_ITF_OB_SWAP_BANK(value) (((value) == HAL_FLASH_ITF_OB_BANK_NO_SWAP) \
                                          || ((value) == HAL_FLASH_ITF_OB_BANK_SWAP))

/*! Macro to check FLASH ITF OB boot0 source selection value */
#define IS_FLASH_ITF_OB_BOOT_SELECT(value) (((value) == HAL_FLASH_ITF_OB_BOOT_OPTION_BIT) \
                                            || ((value) == HAL_FLASH_ITF_OB_BOOT_PIN))

/*! Macro to check FLASH ITF OB boot0 state */
#define IS_FLASH_ITF_OB_BOOT_STATE(value) (((value) == HAL_FLASH_ITF_OB_BOOT_LOW) \
                                           || ((value) == HAL_FLASH_ITF_OB_BOOT_HIGH))

/*! Macro to check FLASH ITF privilege item */
#define IS_FLASH_ITF_PRIV_ITEM(value) ((value) == HAL_FLASH_ITF_PRIV_ITEM_ALL)

/*! Macro to check FLASH ITF privilege attribute */
#define IS_FLASH_ITF_PRIV_ATTR(value) (((value) == HAL_FLASH_ITF_PRIV) || ((value) == HAL_FLASH_ITF_NPRIV))

/**
  * @}
  */

/* Private Functions Prototypes --------------------------------------------------------------------------------------*/

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup FLASH_ITF_Exported_Functions
  * @{
  */

