MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash_itf.c
/** @addtogroup FLASH_ITF_Exported_Functions_Group1
  * @{
This subsection provides a set of functions allowing lock/unlock and configuration of the FLASH ITF peripheral:

- Call the HAL_FLASH_ITF_Lock() functions to lock the access to the FLASH control register.

- Call the HAL_FLASH_ITF_Unlock() functions to unlock the access to the FLASH control register.

- Call the HAL_FLASH_ITF_IsLocked() function to check the lock access state to the FLASH control register.

- Call the HAL_FLASH_ITF_SetLatency() function to set the FLASH latency.

- Call the HAL_FLASH_ITF_GetLatency() function to get the FLASH latency.

- Call the HAL_FLASH_ITF_SetProgrammingDelay() function to set the FLASH programming delay.

- Call the HAL_FLASH_ITF_GetProgrammingDelay() function to get the FLASH programming delay.

- Call the HAL_FLASH_ITF_EnablePrefetch() function to enable the FLASH prefetch.

- Call the HAL_FLASH_ITF_DisablePrefetch() function to disable the FLASH prefetch.

- Call the HAL_FLASH_ITF_IsEnabledPrefetch() function to check if the FLASH prefetch is enabled or disabled.

- Call the HAL_FLASH_ITF_SetEmptyBootLocation() function to set the FLASH empty boot location information.

- Call the HAL_FLASH_ITF_GetEmptyBootLocation() function to get the FLASH empty boot location information.

- Call the HAL_FLASH_ITF_SetHDPExtArea() function to set the HDP extended area.

- Call the HAL_FLASH_ITF_GetHDPExtArea() function to get the HDP extended area.

- Call the HAL_FLASH_ITF_IsLockedRDPOEMKey() function to check if the RDP OEM key is locked or unlocked.

- Call the HAL_FLASH_ITF_IsLockedRDPBSKey() function to check if the RDP BS key is locked or unlocked.

- Call the HAL_FLASH_ITF_ECC_EnableIT() function to enable the FLASH ECC interruption.

- Call the HAL_FLASH_ITF_ECC_DisableIT() function to disable the FLASH ECC interruption.

- Call the HAL_FLASH_ITF_ECC_IsEnabledIT() function to check if the FLASH ECC interruption is enabled or disabled.
 */

/**
  * @brief  Lock the FLASH control register access.
  * @param  instance  The FLASH instance.
  * @retval HAL_OK    FLASH control register access locked.
  * @retval HAL_ERROR Failed to lock FLASH control register access.
  */
hal_status_t HAL_FLASH_ITF_Lock(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  LL_FLASH_Lock(FLASH_GET_ITF_INSTANCE(instance));

  /* Verify that the control register is locked */
  if (LL_FLASH_IsLocked(FLASH_GET_ITF_INSTANCE(instance)) == 0U)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Unlock the FLASH control register access.
  * @param  instance  The FLASH instance.
  * @retval HAL_OK    FLASH control register access unlocked.
  * @retval HAL_ERROR Failed to unlock FLASH control register access.
  */
hal_status_t HAL_FLASH_ITF_Unlock(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  if (LL_FLASH_IsLocked(FLASH_GET_ITF_INSTANCE(instance)) != 0U)
  {
    LL_FLASH_SetUnlockKey(FLASH_GET_ITF_INSTANCE(instance), LL_FLASH_KEY1);
    LL_FLASH_SetUnlockKey(FLASH_GET_ITF_INSTANCE(instance), LL_FLASH_KEY2);

    /* Verify that the control register is unlocked */
    if (LL_FLASH_IsLocked(FLASH_GET_ITF_INSTANCE(instance)) != 0U)
    {
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Check if the FLASH control register access is locked or unlocked.
  * @param  instance The FLASH instance.
  * @retval Returned value can be one element of @ref hal_flash_itf_lock_status_t enumeration.
  */
hal_flash_itf_lock_status_t HAL_FLASH_ITF_IsLocked(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return ((hal_flash_itf_lock_status_t)LL_FLASH_IsLocked(FLASH_GET_ITF_INSTANCE(instance)));
}

/**
  * @brief  Set the FLASH latency configuration.
  * @param  instance The FLASH instance.
  * @param  latency  This parameter is one element of @ref hal_flash_itf_latency_t enumeration.
  * @retval HAL_OK   Latency is successfully configured.
  */
hal_status_t HAL_FLASH_ITF_SetLatency(hal_flash_t instance, hal_flash_itf_latency_t latency)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_LATENCY(latency));

  LL_FLASH_SetLatency(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)latency);

  return HAL_OK;
}

/**
  * @brief  Get the FLASH latency configuration.
  * @param  instance The FLASH instance.
  * @retval hal_flash_itf_latency_t Latency value.
  */
hal_flash_itf_latency_t HAL_FLASH_ITF_GetLatency(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return ((hal_flash_itf_latency_t)LL_FLASH_GetLatency(FLASH_GET_ITF_INSTANCE(instance)));
}

/**
  * @brief  Set the FLASH programming delay configuration.
  * @param  instance   The FLASH instance.
  * @param  prog_delay This parameter is one element of @ref hal_flash_itf_program_delay_t enumeration.
  * @retval HAL_OK     Programming Delay is successfully configured.
  */
hal_status_t HAL_FLASH_ITF_SetProgrammingDelay(hal_flash_t instance, hal_flash_itf_program_delay_t prog_delay)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_PROGRAMMING_DELAY(prog_delay));

  LL_FLASH_SetProgrammingDelay(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)prog_delay);

  return HAL_OK;
}

/**
  * @brief  Get the FLASH programming delay configuration.
  * @param  instance The FLASH instance.
  * @retval hal_flash_itf_program_delay_t programming delay value.
  */
hal_flash_itf_program_delay_t HAL_FLASH_ITF_GetProgrammingDelay(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return ((hal_flash_itf_program_delay_t)LL_FLASH_GetProgrammingDelay(FLASH_GET_ITF_INSTANCE(instance)));
}

/**
  * @brief  Enable the FLASH prefetch.
  * @param  instance The FLASH instance.
  * @retval HAL_OK   Prefetch enabled.
  */
hal_status_t HAL_FLASH_ITF_EnablePrefetch(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  LL_FLASH_EnablePrefetch(FLASH_GET_ITF_INSTANCE(instance));

  return HAL_OK;
}

/**
  * @brief  Disable the FLASH prefetch.
  * @param  instance The FLASH instance.
  * @retval HAL_OK   Prefetch disabled.
  */
hal_status_t HAL_FLASH_ITF_DisablePrefetch(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  LL_FLASH_DisablePrefetch(FLASH_GET_ITF_INSTANCE(instance));

  return HAL_OK;
}

/**
  * @brief  Check if the FLASH prefetch is enabled or disabled.
  * @param  instance The FLASH instance.
  * @retval hal_flash_itf_prefetch_status_t Prefetch status.
  */
hal_flash_itf_prefetch_status_t HAL_FLASH_ITF_IsEnabledPrefetch(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return ((hal_flash_itf_prefetch_status_t)LL_FLASH_IsEnabledPrefetch(FLASH_GET_ITF_INSTANCE(instance)));
}

/**
  * @brief  Set the FLASH empty boot location status.
  * @param  instance   The FLASH instance.
  * @param  empty_boot This parameter is one element of @ref hal_flash_itf_empty_boot_location_t enumeration.
  * @retval HAL_OK  Empty boot location status is successfully configured.
  */
hal_status_t HAL_FLASH_ITF_SetEmptyBootLocation(hal_flash_t instance, hal_flash_itf_empty_boot_location_t empty_boot)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_EMPTY_BOOT_LOCATION(empty_boot));

  LL_FLASH_SetEmptyBootLocation(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)empty_boot);

  return HAL_OK;
}

/**
  * @brief  Get the FLASH empty boot location status.
  * @param  instance The FLASH instance.
  * @retval hal_flash_itf_empty_boot_location_t Empty boot location status.
  */
hal_flash_itf_empty_boot_location_t HAL_FLASH_ITF_GetEmptyBootLocation(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return ((hal_flash_itf_empty_boot_location_t)LL_FLASH_GetEmptyBootLocation(FLASH_GET_ITF_INSTANCE(instance)));
}

/**
  * @brief  Set the FLASH HDP Extended area.
  * @param  instance The FLASH instance.
  * @param  bank     This parameter can be one of the following values:
  *                      @arg @ref HAL_FLASH_BANK_1
  *                      @arg @ref HAL_FLASH_BANK_2
  * @param  page_nbr This parameter can be any value between 0 and the maximum number of pages per bank.
  * @retval HAL_OK   FLASH HDP Extended area number of pages set.
  */
hal_status_t HAL_FLASH_ITF_SetHDPExtArea(hal_flash_t instance, hal_flash_bank_t bank, uint32_t page_nbr)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(bank != HAL_FLASH_BANK_ALL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM(page_nbr < FLASH_PAGE_NB);

  LL_FLASH_SetHDPExtArea(FLASH_GET_ITF_INSTANCE(instance), FLASH_GET_HDPEXT_BANK(bank), page_nbr);

  return HAL_OK;
}

/**
  * @brief Get the FLASH HDP Extended area number of pages.
  * @param  instance The FLASH instance.
  * @param  bank     This parameter can be one of the following values:
  *                      @arg @ref HAL_FLASH_BANK_1
  *                      @arg @ref HAL_FLASH_BANK_2
  * @retval uint32_t FLASH HDP Extended area number of pages value, between 0 and the maximum number of pages per bank.
  */
uint32_t HAL_FLASH_ITF_GetHDPExtArea(hal_flash_t instance, hal_flash_bank_t bank)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(bank != HAL_FLASH_BANK_ALL);
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));

  return LL_FLASH_GetHDPExtArea(FLASH_GET_ITF_INSTANCE(instance), FLASH_GET_HDPEXT_BANK(bank));
}

/**
  * @brief  Check if the FLASH Readout Protection OEM key is locked or unlocked.
  * @param  instance The FLASH instance.
  * @retval hal_flash_itf_rdp_key_lock_status_t Readout Protection OEM key lock status.
  */
hal_flash_itf_rdp_key_lock_status_t HAL_FLASH_ITF_IsLockedRDPOEMKey(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

