MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash_itf.c
  return ((hal_flash_itf_rdp_key_lock_status_t)LL_FLASH_IsActiveFlag_OEMLOCK(FLASH_GET_ITF_INSTANCE(instance)));
}

/**
  * @brief  Check if the FLASH Readout Protection BS key is locked or unlocked.
  * @param  instance The FLASH instance.
  * @retval hal_flash_itf_rdp_key_lock_status_t Readout Protection BS key lock status.
  */
hal_flash_itf_rdp_key_lock_status_t HAL_FLASH_ITF_IsLockedRDPBSKey(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return ((hal_flash_itf_rdp_key_lock_status_t)LL_FLASH_IsActiveFlag_BSLOCK(FLASH_GET_ITF_INSTANCE(instance)));
}


#if defined (USE_HAL_FLASH_ECC) && (USE_HAL_FLASH_ECC == 1)
/**
  * @brief  Enable the given FLASH ECC interrupt.
  * @param  instance The FLASH instance.
  * @param  interrupt The ECC interrupt to enable.
  * @retval HAL_OK ECC interruption enabled.
  */
hal_status_t HAL_FLASH_ITF_ECC_EnableIT(hal_flash_t instance, uint32_t interrupt)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_ECC_INTERRUPT(interrupt));

  STM32_UNUSED(interrupt);

  LL_FLASH_EnableIT_ECCC(FLASH_GET_ITF_INSTANCE(instance));

  return HAL_OK;
}

/**
  * @brief  Disable the given FLASH ECC interrupt.
  * @param  instance The FLASH instance.
  * @param  interrupt The ECC interrupt to disable.
  * @retval HAL_OK ECC interruption disabled.
  */
hal_status_t HAL_FLASH_ITF_ECC_DisableIT(hal_flash_t instance, uint32_t interrupt)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_ECC_INTERRUPT(interrupt));

  STM32_UNUSED(interrupt);

  LL_FLASH_DisableIT_ECCC(FLASH_GET_ITF_INSTANCE(instance));

  return HAL_OK;
}

/**
  * @brief  Check if the given FLASH ECC interrupt is enabled or disabled.
  * @param  instance The FLASH instance.
  * @param  interrupt The ECC interrupt to check.
  * @retval Return value can be one element of @ref hal_flash_itf_ecc_it_status_t enumeration.
  */
hal_flash_itf_ecc_it_status_t HAL_FLASH_ITF_ECC_IsEnabledIT(hal_flash_t instance, uint32_t interrupt)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_ECC_INTERRUPT(interrupt));

  STM32_UNUSED(interrupt);

  return (hal_flash_itf_ecc_it_status_t)LL_FLASH_IsEnabledIT_ECCC(FLASH_GET_ITF_INSTANCE(instance));
}
#endif /* USE_HAL_FLASH_ECC */
/**
  * @}
  */

/** @addtogroup FLASH_ITF_Exported_Functions_Group2
  * @{
This subsection provides a set of functions allowing configuration of the FLASH peripheral option bytes:


- Call the HAL_FLASH_ITF_OB_Lock() function to lock the access to the FLASH option bytes registers.

- Call the HAL_FLASH_ITF_OB_Unlock() function to unlock the access to the FLASH option bytes registers.

- Call the HAL_FLASH_ITF_OB_IsLocked() function to check the lock state of the access to the FLASH option bytes

- Call the HAL_FLASH_ITF_OB_LockOTPBlock() function to lock the selected OTP blocks.

- Call the HAL_FLASH_ITF_OB_IsLockedOTPBlock() function to check if the selected OTP block is locked.

- Call the HAL_FLASH_ITF_OB_EnableEDATAArea() function to enable the EDATA area.

- Call the HAL_FLASH_ITF_OB_DisableEDATAArea() function to disable the EDATA area.

- Call the HAL_FLASH_ITF_OB_IsEnabledEDATAArea() function to check if the EDATA area is enabled or disabled.

- Call the HAL_FLASH_ITF_OB_EnablePageWRP() function to enable the FLASH ITF OB pagewise write protection area
  configuration.

- Call the HAL_FLASH_ITF_OB_DisablePageWRP() function to disable the FLASH ITF OB pagewise write protection area
  configuration.

- Call the HAL_FLASH_ITF_OB_IsEnabledPageWRP() function to check if the FLASH ITF OB pagewise write protection area
  configuration is enabled or disabled.

- Call the HAL_FLASH_ITF_OB_SetRDPLevel() function to set the FLASH ITF OB read-out protection level.

- Call the HAL_FLASH_ITF_OB_GetRDPLevel() function to get the FLASH ITF OB read-out protection level.

- Call the HAL_FLASH_ITF_OB_SetRDPOEMKey() function to set the FLASH ITF OB read-out protection OEM keys.
- Call the HAL_FLASH_ITF_OB_SetRDPBSKey() function to set the FLASH ITF OB read-out protection BS key.

- Call the HAL_FLASH_ITF_OB_SetEnterLowPWRModeRstGeneration() function to set the FLASH ITF OB enter stop mode,
  or standby mode reset generation configuration.

- Call the HAL_FLASH_ITF_OB_GetEnterLowPWRModeRstGeneration() function to get the FLASH ITF OB enter stop mode,
  or standby mode reset generation configuration.

- Call the HAL_FLASH_ITF_OB_SetSystemRstSRAMErase() function to set the FLASH ITF OB system reset SRAM1 and SRAM2 erase
  configuration.

- Call the HAL_FLASH_ITF_OB_GetSystemRstSRAMErase() function to get the FLASH ITF OB system reset SRAM1 and SRAM2 erase
  configuration.

- Call the HAL_FLASH_ITF_OB_SetIWDGMode() function to set the FLASH ITF OB IWDG mode configuration.

- Call the HAL_FLASH_ITF_OB_GetIWDGMode() function to get the FLASH ITF OB IWDG mode configuration.

- Call the HAL_FLASH_ITF_OB_SetWWDGMode() function to set the FLASH ITF OB WWDG mode configuration.

- Call the HAL_FLASH_ITF_OB_GetWWDGMode() function to get the FLASH ITF OB WWDG mode configuration.

- Call the HAL_FLASH_ITF_OB_FreezeIWDGCounterLowPWRMode() function to freeze the FLASH ITF OB IWDG for stop and standby
  counter configuration.

- Call the HAL_FLASH_ITF_OB_UnfreezeIWDGCounterLowPWRMode() function to unfreeze the FLASH ITF OB IWDG stop and standby
  counter configuration.

- Call the HAL_FLASH_ITF_OB_IsFrozenIWDGCounterLowPWRMode() function to check the FLASH ITF OB IWDG stop and standby
  counter configuration is enabled.

- Call the HAL_FLASH_ITF_OB_SetBankSwap() function to set the FLASH ITF OB swap bank configuration.

- Call the HAL_FLASH_ITF_OB_GetBankSwap() function to get the FLASH ITF OB swap bank configuration.

- Call the HAL_FLASH_ITF_OB_IsBankSwapped() function to check the FLASH ITF OB swap bank.

- Call the HAL_FLASH_ITF_OB_SetBankTopology() function to set the FLASH ITF OB single dual bank configuration.

- Call the HAL_FLASH_ITF_OB_GetBankTopology() function to get the FLASH ITF OB single dual bank configuration.

- Call the HAL_FLASH_ITF_OB_EnableSRAMECC() function to enable the FLASH ITF OB for SRAM2 ECC configuration.

