MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash_itf.c
- Call the HAL_FLASH_ITF_OB_DisableSRAMECC() function to disable the FLASH ITF OB for SRAM2 ECC configuration.

- Call the HAL_FLASH_ITF_OB_IsEnabledSRAMECC() function to check the FLASH ITF OB for SRAM2 ECC configuration
  is enabled.

- Call the HAL_FLASH_ITF_OB_SetBootSelection() function to set the FLASH ITF OB boot source selection.

- Call the HAL_FLASH_ITF_OB_GetBootSelection() function to get the FLASH ITF OB boot source selection.

- Call the HAL_FLASH_ITF_OB_SetBoot0() function to set the FLASH ITF OB boot0 configuration.

- Call the HAL_FLASH_ITF_OB_GetBoot0() function to get the FLASH ITF OB boot0 configuration.

- Call the HAL_FLASH_ITF_OB_SetHDPArea() function to set the FLASH ITF OB hide protection area configuration.

- Call the HAL_FLASH_ITF_OB_GetHDPArea() function to get the FLASH ITF OB hide protection area configuration.

- Call the HAL_FLASH_ITF_OB_SetBootAddr() function to set the FLASH OB boot address configuration.

- Call the HAL_FLASH_ITF_OB_GetBootAddr() function to get the FLASH OB boot address configuration.

- Call the HAL_FLASH_ITF_OB_LockBootConfig() function to lock the FLASH option bytes boot configuration.

- Call the HAL_FLASH_ITF_OB_UnlockBootConfig() function to unlock the FLASH option bytes boot configuration.

- Call the HAL_FLASH_ITF_OB_IsLockedBootConfig() function to Check if the FLASH ITF OB boot configuration
  is locked or unlocked.

- Call the HAL_FLASH_ITF_OB_SetBootloaderInterfaceConfig() function to set the bootloader interface configuration.

- Call the HAL_FLASH_ITF_OB_GetBootloaderInterfaceConfig() function to get the bootloader interface configuration.
  */

/**
  * @brief  Lock the  FLASH OB control register access.
  * @param  instance  The FLASH instance.
  * @retval HAL_OK    FLASH OB control register access is successfully locked.
  * @retval HAL_ERROR Failed to lock FLASH OB control register access.
  */
hal_status_t HAL_FLASH_ITF_OB_Lock(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  LL_FLASH_OB_Lock(FLASH_GET_ITF_INSTANCE(instance));

  /* Verify that the Option bytes are locked */
  if (LL_FLASH_OB_IsLocked(FLASH_GET_ITF_INSTANCE(instance)) == 0U)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Unlock the FLASH OB control register access.
  * @param  instance  The FLASH instance.
  * @retval HAL_OK    FLASH OB control register access is successfully unlocked.
  * @retval HAL_ERROR Failed to unlock FLASH OB control register access
  */
hal_status_t HAL_FLASH_ITF_OB_Unlock(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  if (LL_FLASH_OB_IsLocked(FLASH_GET_ITF_INSTANCE(instance)) != 0U)
  {
    LL_FLASH_OB_SetUnlockKey(FLASH_GET_ITF_INSTANCE(instance), LL_FLASH_OB_OPTKEY1);
    LL_FLASH_OB_SetUnlockKey(FLASH_GET_ITF_INSTANCE(instance), LL_FLASH_OB_OPTKEY2);

    /* Verify that the Option bytes are unlocked */
    if (LL_FLASH_OB_IsLocked(FLASH_GET_ITF_INSTANCE(instance)) != 0U)
    {
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Check if the FLASH OB control register access is locked or unlocked.
  * @param  instance  The FLASH instance.
  * @retval Return value can be one element of @ref hal_flash_itf_ob_lock_status_t enumeration.
  */
hal_flash_itf_ob_lock_status_t HAL_FLASH_ITF_OB_IsLocked(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return ((hal_flash_itf_ob_lock_status_t)LL_FLASH_OB_IsLocked(FLASH_GET_ITF_INSTANCE(instance)));
}

/**
  * @brief  Lock the selected blocks of the OTP flash area.
  * @param  instance  The FLASH instance.
  * @param  start_otp_block  Start OTP block.
  *                          This parameter can take any value from 0 to 23.
  * @param  otp_block_nbr    OTP block number.
  *                          This parameter can take any value from 1 to 24.
  * @note   To configure the locked OTP blocks, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB OTP blocks are successfully locked.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_LockOTPBlock(hal_flash_t instance, uint32_t start_otp_block, uint32_t otp_block_nbr)
{
  uint32_t otp_blk_mask = 0U;

  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(start_otp_block < FLASH_ITF_OB_OTP_BLOCK_NBR);
  ASSERT_DBG_PARAM((otp_block_nbr != 0U) && (otp_block_nbr <= FLASH_ITF_OB_OTP_BLOCK_NBR));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check that the OTP blocks range is valid */
  if ((start_otp_block + otp_block_nbr) > FLASH_ITF_OB_OTP_BLOCK_NBR)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  /* Repeat for page number to be protected */
  for (uint32_t count = 0U; count < otp_block_nbr; count++)
  {
    otp_blk_mask |= (1UL << (start_otp_block + count));
  }

  LL_FLASH_OB_LockOTPBlock(FLASH_GET_ITF_INSTANCE(instance), otp_blk_mask);

  return HAL_OK;
}

/**
  * @brief  Check if the selected OTP blocks are locked.
  * @param  instance The FLASH instance.
  * @param  otp_block OTP block to check.
  *                   This parameter can take any value from 0 to 23.
  * @retval Return value can be one element of @ref hal_flash_itf_ob_otp_blk_lock_status_t enumeration.
  */
hal_flash_itf_ob_otp_blk_lock_status_t HAL_FLASH_ITF_OB_IsLockedOTPBlock(hal_flash_t instance, uint32_t otp_block)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return (hal_flash_itf_ob_otp_blk_lock_status_t)LL_FLASH_OB_IsLockedOTPBlock(FLASH_GET_ITF_INSTANCE(instance), \
                                                                              (1UL << otp_block));
}


/**
  * @brief  Enable the write protection feature on the selected pages of the given bank.
  * @param  instance   The FLASH instance.
  * @param  bank       This parameter can be one of the following values:
  *                        @arg @ref HAL_FLASH_BANK_1
  *                        @arg @ref HAL_FLASH_BANK_2
  * @param  start_page Starting page number for enabling write protection.
  *                    This parameter can be any value between 0 and (FLASH_PAGE_NB - 1).
  * @param  page_nbr   Number of pages to be write protected.
  *                    This parameter can be any value between 1 and FLASH_PAGE_NB.
  * @note   To configure the write protected pages, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB write protection area is successfully configured.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_EnablePageWRP(hal_flash_t instance,
                                            hal_flash_bank_t bank,
                                            uint32_t start_page,
                                            uint32_t page_nbr)
{
  uint32_t page_mask = 0U;

  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM(start_page < FLASH_PAGE_NB);
  ASSERT_DBG_PARAM((page_nbr != 0U) && (page_nbr <= FLASH_PAGE_NB));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((start_page + page_nbr) > FLASH_PAGE_NB)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  /* Repeat for page number to be protected */
  for (uint32_t count = 0U; count < page_nbr; count++)
  {
    page_mask |= (1UL << ((start_page + count) / FLASH_WRP_GROUP_WIDTH));
  }

  LL_FLASH_OB_EnablePageWRP(FLASH_GET_ITF_INSTANCE(instance), (uint32_t) bank, page_mask);

  return HAL_OK;
}

/**
  * @brief  Disable the write protection feature on the selected pages of the given bank.
  * @param  instance   The FLASH instance.
  * @param  bank       This parameter can be one of the following values:
  *                        @arg @ref HAL_FLASH_BANK_1
  *                        @arg @ref HAL_FLASH_BANK_2
  * @param  start_page Starting page number for disabling write protection.
  *                    This parameter can be any value between 0 and (FLASH_PAGE_NB - 1).
  * @param  page_nbr   Number of pages for disabling write protection.
  *                    This parameter can be any value between 1 and FLASH_PAGE_NB.
  * @note   To configure the write protected pages, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB write protection area is successfully configured.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_DisablePageWRP(hal_flash_t instance,
                                             hal_flash_bank_t bank,
                                             uint32_t start_page,
                                             uint32_t page_nbr)
{
  uint32_t page_mask = 0U;

  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM(start_page < FLASH_PAGE_NB);
  ASSERT_DBG_PARAM((page_nbr != 0U) && (page_nbr <= FLASH_PAGE_NB));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((start_page + page_nbr) > FLASH_PAGE_NB)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  /* Repeat for page number to be protected */
  for (uint32_t count = 0U; count < page_nbr; count++)
  {
    page_mask |= (1UL << ((start_page + count) / FLASH_WRP_GROUP_WIDTH));
  }

  LL_FLASH_OB_DisablePageWRP(FLASH_GET_ITF_INSTANCE(instance), (uint32_t) bank, page_mask);

  return HAL_OK;
}

/**
  * @brief  Get the state  of page write protection configuration for the selected pages of the given bank.
  * @param  instance The FLASH instance.
  * @param  bank     This parameter can be one of the following values:
  *                      @arg @ref HAL_FLASH_BANK_1
  *                      @arg @ref HAL_FLASH_BANK_2
  * @param  page     This parameter can be any value between 0 and FLASH_PAGE_NB.
  * @retval Return value can be one element of @ref hal_flash_itf_ob_wrp_page_status_t enumeration.
  */
hal_flash_itf_ob_wrp_page_status_t HAL_FLASH_ITF_OB_IsEnabledPageWRP(hal_flash_t instance,
                                                                     hal_flash_bank_t bank,
                                                                     uint32_t page)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));

  return (hal_flash_itf_ob_wrp_page_status_t)LL_FLASH_OB_IsEnabledPageWRP(FLASH_GET_ITF_INSTANCE(instance), \
                                                                          (uint32_t)FLASH_GET_ITF_BANK(bank), \
                                                                          (1UL << (page / FLASH_WRP_GROUP_WIDTH)));
}

/**
  * @brief  Enable the data flash area.
  * @param  instance  The FLASH instance.
  * @note   Before enabling the data flash area, the option lock bit OPTLOCK must
  *         be previously cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB data FLASH is successfully enabled.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_EnableEDATAArea(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_EnableEDATAArea(FLASH_GET_ITF_INSTANCE(instance));
  return HAL_OK;
}

/**
  * @brief  Disable the data flash area.
  * @param  instance  The FLASH instance.
  * @note   To disable the data flash area, the option lock bit OPTLOCK mustbe cleared
  *         with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB data FLASH is successfully disabled.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_DisableEDATAArea(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

