MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash_itf.c
  LL_FLASH_OB_DisableEDATAArea(FLASH_GET_ITF_INSTANCE(instance));
  return HAL_OK;
}

/**
  * @brief  Check if the data flash area of the selected bank is enabled or not.
  * @param  instance The FLASH instance.
  * @retval Return value can be one element of @ref hal_flash_itf_ob_edata_area_status_t enumeration.
  */
hal_flash_itf_ob_edata_area_status_t HAL_FLASH_ITF_OB_IsEnabledEDATAArea(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return (hal_flash_itf_ob_edata_area_status_t)LL_FLASH_OB_IsEnabledEDATAArea(FLASH_GET_ITF_INSTANCE(instance));
}

/**
  * @brief  Set the HDP area.
  * @param  instance   The FLASH instance.
  * @param  bank       This parameter can be one of the following values:
  *                        @arg @ref HAL_FLASH_BANK_1
  *                        @arg @ref HAL_FLASH_BANK_2
  * @param  start_page This parameter can take any value between 0 and the maximum number of pages.
  * @param  page_nbr   Number of page of the hide protection area.
  * @note   To configure the HDP area start page, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK     FLASH OB HDP area start page is successfully configured.
  * @retval HAL_ERROR  FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetHDPArea(hal_flash_t instance,
                                         hal_flash_bank_t bank,
                                         uint32_t start_page,
                                         uint32_t page_nbr)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM(start_page < FLASH_PAGE_NB);

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_ConfigHDPArea(FLASH_GET_ITF_INSTANCE(instance), \
                            (uint32_t)FLASH_GET_ITF_BANK(bank), start_page, start_page + page_nbr - 1U);
  return HAL_OK;
}

/**
  * @brief  Get the hide protection area configuration.
  * @param  instance     The FLASH instance.
  * @param  bank         This parameter can be one of the following values:
  *                          @arg @ref HAL_FLASH_BANK_1
  *                          @arg @ref HAL_FLASH_BANK_2
  * @param  p_start_page Pointer to start page of the hide protection area.
  * @param  p_page_nbr   Pointer to number of page of the hide protection area.
  */
void HAL_FLASH_ITF_OB_GetHDPArea(hal_flash_t instance, hal_flash_bank_t bank,
                                 uint32_t *p_start_page, uint32_t *p_page_nbr)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_BANK(bank));
  ASSERT_DBG_PARAM(p_start_page != NULL);
  ASSERT_DBG_PARAM(p_page_nbr != NULL);

  *p_start_page = LL_FLASH_OB_GetHDPAreaStartPage(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)FLASH_GET_ITF_BANK(bank));
  *p_page_nbr   = (LL_FLASH_OB_GetHDPAreaEndPage(FLASH_GET_ITF_INSTANCE(instance), \
                                                 (uint32_t)FLASH_GET_ITF_BANK(bank)) - *p_start_page + 1U);
}

/**
  * @brief  Set the RDP level.
  * @param  instance  The FLASH instance.
  * @param  rdp_level Element from the @ref hal_flash_itf_ob_rdp_level_t enumeration.
  * @note   To configure the RDP level, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB RDP level is successfully configured.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetRDPLevel(hal_flash_t instance, hal_flash_itf_ob_rdp_level_t rdp_level)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_RDP_LEVEL(rdp_level));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetRDPLevel(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)rdp_level);
  return HAL_OK;
}

/**
  * @brief  Get the FLASH OB RDP level configuration.
  * @param  instance The FLASH instance.
  * @retval Return value can be one element of @ref hal_flash_itf_ob_rdp_level_t enumeration.
  */
hal_flash_itf_ob_rdp_level_t HAL_FLASH_ITF_OB_GetRDPLevel(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return (hal_flash_itf_ob_rdp_level_t)LL_FLASH_OB_GetRDPLevel(FLASH_GET_ITF_INSTANCE(instance));
}

/**
  * @brief  Set the FLASH OB OEM key configuration.
  * @param  instance  The FLASH instance.
  * @param  p_key     Pointer to the key value.
  * @note   To configure the OEM key, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB OEM key is successfully configured.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetRDPOEMKey(hal_flash_t instance, const hal_flash_itf_ob_rdp_oem_key_t *p_key)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetOEMKeyWord1(FLASH_GET_ITF_INSTANCE(instance), p_key->key_w1);
  LL_FLASH_OB_SetOEMKeyWord2(FLASH_GET_ITF_INSTANCE(instance), p_key->key_w2);
  LL_FLASH_OB_SetOEMKeyWord3(FLASH_GET_ITF_INSTANCE(instance), p_key->key_w3);
  LL_FLASH_OB_SetOEMKeyWord4(FLASH_GET_ITF_INSTANCE(instance), p_key->key_w4);

  return HAL_OK;
}

/**
  * @brief  Set the FLASH OB BS key configuration.
  * @param  instance  The FLASH instance.
  * @param  p_key     Pointer to the key value.
  * @note   To configure the BS key, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB BS key is successfully configured.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetRDPBSKey(hal_flash_t instance, const hal_flash_itf_ob_rdp_bs_key_t *p_key)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetBSKey(FLASH_GET_ITF_INSTANCE(instance), p_key->key_w1);

  return HAL_OK;
}


/**
  * @brief  Set the FLASH OB enter stop mode reset generation configuration.
  * @param  instance  The FLASH instance.
  * @param  low_pwr_mode
  *         This parameter can take one of the following values:
  *         @arg @ref HAL_FLASH_ITF_OB_STOP_MODE
  *         @arg @ref HAL_FLASH_ITF_OB_STANDBY_MODE
  * @param  rst_gen   Element from the @ref hal_flash_itf_ob_rst_generation_status_t enumeration.
  * @note   To configure the reset generation upon entering stop mode, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB enter low-power mode reset generation is successfully configured.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetEnterLowPWRModeRstGeneration(hal_flash_t instance, uint32_t low_pwr_mode,
                                                              hal_flash_itf_ob_rst_generation_status_t rst_gen)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM((low_pwr_mode & FLASH_ITF_OB_LOW_PWR_MSK) == low_pwr_mode);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_RST_GENERATION(rst_gen));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_STOP_MODE) == HAL_FLASH_ITF_OB_STOP_MODE)
  {
    LL_FLASH_OB_SetNRSTStopMode(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)rst_gen * LL_FLASH_OB_NO_RST_STOP_MODE);
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_STANDBY_MODE) == HAL_FLASH_ITF_OB_STANDBY_MODE)
  {
    LL_FLASH_OB_SetNRSTStandbyMode(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)rst_gen * LL_FLASH_OB_NO_RST_STDBY_MODE);
  }

  return HAL_OK;
}

/**
  * @brief  Get the FLASH OB enter stop mode reset generation configuration.
  * @param  instance  The FLASH instance.
  * @param  low_pwr_mode
  *         This parameter can take one of the following values:
  *         @arg @ref HAL_FLASH_ITF_OB_STOP_MODE
  *         @arg @ref HAL_FLASH_ITF_OB_STANDBY_MODE
  * @retval Return value can be one element of @ref hal_flash_itf_ob_rst_generation_status_t enumeration.
  */
hal_flash_itf_ob_rst_generation_status_t HAL_FLASH_ITF_OB_GetEnterLowPWRModeRstGeneration(hal_flash_t instance,
    uint32_t low_pwr_mode)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_LOW_PWR_MODE(low_pwr_mode));

  if (low_pwr_mode == HAL_FLASH_ITF_OB_STOP_MODE)
  {
    return (hal_flash_itf_ob_rst_generation_status_t)
           ((uint32_t)(LL_FLASH_OB_GetNRSTStopMode(FLASH_GET_ITF_INSTANCE(instance)) >> FLASH_OPTSR_PRG_NRST_STOP_Pos));
  }
  else
  {
    return (hal_flash_itf_ob_rst_generation_status_t)
           ((uint32_t)(LL_FLASH_OB_GetNRSTStandbyMode(FLASH_GET_ITF_INSTANCE(instance)) \
                       >> FLASH_OPTSR_PRG_NRST_STDBY_Pos));
  }
}

/**
  * @brief  Set the FLASH OB system reset SRAM erase configuration.
  * @param  instance   The FLASH instance.
  * @param  sram
  *         This parameter can take one of the following values:
  *         @arg @ref HAL_FLASH_ITF_OB_SRAM2
  *         @arg @ref HAL_FLASH_ITF_OB_SRAM1
  * @param  sram_erase Element from the @ref hal_flash_itf_ob_sys_rst_sram_erase_t enumeration.
  * @note   To configure the SRAM erase upon system reset, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK     FLASH OB erase SRAM on system reset is successfully configured.
  * @retval HAL_ERROR  FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetSystemRstSRAMErase(hal_flash_t instance,
                                                    uint32_t sram,
                                                    hal_flash_itf_ob_sys_rst_sram_erase_t sram_erase)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM((sram & FLASH_ITF_OB_SRAM_ERASE_MSK) == sram);
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_SYSTEM_RST_SRAM_ERASE(sram_erase));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  if ((sram & HAL_FLASH_ITF_OB_SRAM2) == HAL_FLASH_ITF_OB_SRAM2)
  {
    LL_FLASH_OB_SetSystemResetSRAM2Erase(FLASH_GET_ITF_INSTANCE(instance), \
                                         (uint32_t)sram_erase * LL_FLASH_OB_NOT_ERASED_SRAM2_SYS_RST);
  }

  if ((sram & HAL_FLASH_ITF_OB_SRAM1) == HAL_FLASH_ITF_OB_SRAM1)
  {
    LL_FLASH_OB_SetSystemResetSRAM1Erase(FLASH_GET_ITF_INSTANCE(instance), \
                                         (uint32_t)sram_erase * LL_FLASH_OB_NOT_ERASED_SRAM1_SYS_RST);
  }

  return HAL_OK;
}

/**
  * @brief  Get the FLASH OB system reset SRAM erase configuration.
  * @param  instance The FLASH instance.
  * @param  sram
  *         This parameter can take one of the following values:
  *         @arg @ref HAL_FLASH_ITF_OB_SRAM2
  *         @arg @ref HAL_FLASH_ITF_OB_SRAM1
  * @retval Return value can be one element of @ref hal_flash_itf_ob_sys_rst_sram_erase_t enumeration.
  */
hal_flash_itf_ob_sys_rst_sram_erase_t HAL_FLASH_ITF_OB_GetSystemRstSRAMErase(hal_flash_t instance, uint32_t sram)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_SRAM_ERASE(sram));

  if (sram == HAL_FLASH_ITF_OB_SRAM2)
  {
    return (hal_flash_itf_ob_sys_rst_sram_erase_t)
           ((uint32_t)(LL_FLASH_OB_GetSystemResetSRAM2Erase(FLASH_GET_ITF_INSTANCE(instance)) \
                       >> FLASH_OPTSR2_PRG_SRAM2_RST_Pos));
  }
  else
  {
    return (hal_flash_itf_ob_sys_rst_sram_erase_t)
           ((uint32_t)(LL_FLASH_OB_GetSystemResetSRAM1Erase(FLASH_GET_ITF_INSTANCE(instance)) \
                       >> FLASH_OPTSR2_PRG_SRAM1_RST_Pos));
  }
}

/**
  * @brief  Set the FLASH OB IWDG mode configuration.
  * @param  instance  The FLASH instance.
  * @param  mode      Element from the @ref hal_flash_itf_ob_wdg_mode_t enumeration.
  * @note   To configure the IWDG control mode, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB IWDG mode is successfully configured.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetIWDGMode(hal_flash_t instance, hal_flash_itf_ob_wdg_mode_t mode)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_WDG_HW_SW_MODE(mode));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetIWDGSelection(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)mode * LL_FLASH_OB_IWDG_SW);

  return HAL_OK;
}

/**
  * @brief  Get the FLASH OB IWDG mode configuration.
  * @param  instance The FLASH instance.
  * @retval Return value can be one element of @ref hal_flash_itf_ob_wdg_mode_t enumeration.
  */
hal_flash_itf_ob_wdg_mode_t HAL_FLASH_ITF_OB_GetIWDGMode(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

