MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash_itf.c
  return (hal_flash_itf_ob_wdg_mode_t)((uint32_t)(LL_FLASH_OB_GetIWDGSelection(FLASH_GET_ITF_INSTANCE(instance)) \
                                                  >> FLASH_OPTSR_PRG_IWDG_SW_Pos));
}

/**
  * @brief  Set the FLASH OB WWDG mode configuration.
  * @param  instance  The FLASH instance.
  * @param  mode      Element from the @ref hal_flash_itf_ob_wdg_mode_t enumeration.
  * @note   To configure the WWDG control mode, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB WWDG mode is successfully configured.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetWWDGMode(hal_flash_t instance, hal_flash_itf_ob_wdg_mode_t mode)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_WDG_HW_SW_MODE(mode));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetWWDGSelection(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)mode * LL_FLASH_OB_WWDG_SW);

  return HAL_OK;
}

/**
  * @brief  Get the FLASH OB WWDG mode configuration.
  * @param  instance The FLASH instance.
  * @retval Return value can be one element of @ref hal_flash_itf_ob_wdg_mode_t enumeration.
  */
hal_flash_itf_ob_wdg_mode_t HAL_FLASH_ITF_OB_GetWWDGMode(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return (hal_flash_itf_ob_wdg_mode_t)((uint32_t)(LL_FLASH_OB_GetWWDGSelection(FLASH_GET_ITF_INSTANCE(instance)) \
                                                  >> FLASH_OPTSR_PRG_WWDG_SW_Pos));
}

/**
  * @brief  Freeze the FLASH OB IWDG counter in low power mode configuration.
  * @param  instance  The FLASH instance.
  * @param  low_pwr_mode
  *         This parameter can take one of the following values:
  *         @arg @ref HAL_FLASH_ITF_OB_STOP_MODE
  *         @arg @ref HAL_FLASH_ITF_OB_STANDBY_MODE
  * @note   To configure the IWDG freeze in low-power mode, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB IWDG counter is frozen in specified low-power mode.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_FreezeIWDGCounterLowPWRMode(hal_flash_t instance, uint32_t low_pwr_mode)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM((low_pwr_mode & FLASH_ITF_OB_LOW_PWR_MSK) == low_pwr_mode);

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_STOP_MODE) == HAL_FLASH_ITF_OB_STOP_MODE)
  {
    LL_FLASH_OB_FreezeIWDGStopMode(FLASH_GET_ITF_INSTANCE(instance));
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_STANDBY_MODE) == HAL_FLASH_ITF_OB_STANDBY_MODE)
  {
    LL_FLASH_OB_FreezeIWDGStandbyMode(FLASH_GET_ITF_INSTANCE(instance));
  }

  return HAL_OK;
}

/**
  * @brief  Unfreeze the FLASH OB IWDG counter in low-power mode configuration.
  * @param  instance  The FLASH instance.
  * @param  low_pwr_mode
  *         This parameter can take one of the following values:
  *         @arg @ref HAL_FLASH_ITF_OB_STOP_MODE
  *         @arg @ref HAL_FLASH_ITF_OB_STANDBY_MODE
  * @note   To configure the IWDG freeze in low-power mode, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB IWDG counter is not frozen in specified low-power mode.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_UnfreezeIWDGCounterLowPWRMode(hal_flash_t instance, uint32_t low_pwr_mode)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM((low_pwr_mode & FLASH_ITF_OB_LOW_PWR_MSK) == low_pwr_mode);

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_STOP_MODE) == HAL_FLASH_ITF_OB_STOP_MODE)
  {
    LL_FLASH_OB_UnfreezeIWDGStopMode(FLASH_GET_ITF_INSTANCE(instance));
  }

  if ((low_pwr_mode & HAL_FLASH_ITF_OB_STANDBY_MODE) == HAL_FLASH_ITF_OB_STANDBY_MODE)
  {
    LL_FLASH_OB_UnfreezeIWDGStandbyMode(FLASH_GET_ITF_INSTANCE(instance));
  }

  return HAL_OK;
}

/**
  * @brief  Check the FLASH OB freeze IWDG counter in low-power mode configuration.
  * @param  instance The FLASH instance.
  * @param  low_pwr_mode
  *         This parameter can take one of the following values:
  *         @arg @ref HAL_FLASH_ITF_OB_STOP_MODE
  *         @arg @ref HAL_FLASH_ITF_OB_STANDBY_MODE
  * @retval Return value can be one element of @ref hal_flash_itf_ob_wdg_freeze_status_t enumeration.
  */
hal_flash_itf_ob_wdg_freeze_status_t HAL_FLASH_ITF_OB_IsFrozenIWDGCounterLowPWRMode(hal_flash_t instance,
    uint32_t low_pwr_mode)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_LOW_PWR_MODE(low_pwr_mode));

  if (low_pwr_mode == HAL_FLASH_ITF_OB_STOP_MODE)
  {
    return (hal_flash_itf_ob_wdg_freeze_status_t)LL_FLASH_OB_IsFrozenIWDGStopMode(FLASH_GET_ITF_INSTANCE(instance));
  }
  else
  {
    return (hal_flash_itf_ob_wdg_freeze_status_t)LL_FLASH_OB_IsFrozenIWDGStandbyMode(FLASH_GET_ITF_INSTANCE(instance));
  }
}

/**
  * @brief  Set the FLASH ITF OB boot0 configuration.
  * @param  instance    The FLASH instance.
  * @param  boot_select Element from @ref hal_flash_itf_ob_boot_selection_t enumeration.
  * @retval HAL_OK      FLASH ITF OB boot0 is successfully configured.
  * @retval HAL_ERROR   FLASH ITF OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetBootSelection(hal_flash_t instance, hal_flash_itf_ob_boot_selection_t boot_select)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_BOOT_SELECT(boot_select));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetBoot0SourceSelection(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)boot_select);
  return HAL_OK;
}

/**
  * @brief  Get the FLASH ITF OB boot0 source selection configuration.
  * @param  instance The FLASH instance.
  * @retval hal_flash_itf_ob_boot_selection_t FLASH ITF OB boot0 source selected.
  */
hal_flash_itf_ob_boot_selection_t HAL_FLASH_ITF_OB_GetBootSelection(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return (hal_flash_itf_ob_boot_selection_t)LL_FLASH_OB_GetBoot0SourceSelection(FLASH_GET_ITF_INSTANCE(instance));
}

/**
  * @brief  Set the FLASH ITF OB boot0 option bit state configuration.
  * @param  instance  The FLASH instance.
  * @param  state     Element from @ref hal_flash_itf_ob_boot_state_t enumeration.
  * @retval HAL_OK    FLASH ITF OB boot0 is successfully configured.
  * @retval HAL_ERROR FLASH ITF OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetBoot0(hal_flash_t instance, hal_flash_itf_ob_boot_state_t state)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_BOOT_STATE(state));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetBoot0(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)state);
  return HAL_OK;
}

/**
  * @brief  Get the FLASH ITF OB boot0 option bit state configuration.
  * @param  instance The FLASH instance.
  * @retval hal_flash_itf_ob_boot_selection_t FLASH ITF OB boot0 option bit state configuration.
  */
hal_flash_itf_ob_boot_state_t HAL_FLASH_ITF_OB_GetBoot0(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return (hal_flash_itf_ob_boot_state_t)LL_FLASH_OB_GetBoot0(FLASH_GET_ITF_INSTANCE(instance));
}

/**
  * @brief  Set the FLASH ITF OB single/dual bank configuration for products with less user memory.
  * @param  instance      The FLASH instance.
  * @param  bank_topology This parameter is one element of @ref hal_flash_itf_ob_topology_t  enumeration.
  * @note   Before setting the bank topology, the option lock bit OPTLOCK must
  *         be previously cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB single-bank option bit value is successfully enabled.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetBankTopology(hal_flash_t instance, hal_flash_itf_ob_topology_t bank_topology)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_SINGLE_DUAL_BANK(bank_topology));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

