MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash_itf.c
  LL_FLASH_OB_SetBank(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)bank_topology);
  return HAL_OK;
}

/**
  * @brief  Get the FLASH ITF OB single/dual bank configuration.
  * @param  instance The FLASH instance.
  * @retval hal_flash_itf_ob_topology_t FLASH ITF OB single/dual bank configuration.
  */
hal_flash_itf_ob_topology_t HAL_FLASH_ITF_OB_GetBankTopology(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return (hal_flash_itf_ob_topology_t)LL_FLASH_OB_GetBank(FLASH_GET_ITF_INSTANCE(instance));
}

/**
  * @brief  Set the FLASH OB bank swapping configuration.
  * @param  instance  The FLASH instance.
  * @param  bank_swap This parameter is one element of @ref hal_flash_itf_ob_bank_swap_t enumeration.
  * @note   To configure the bank swapping, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB bank swapping is successfully configured.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetBankSwap(hal_flash_t instance, hal_flash_itf_ob_bank_swap_t bank_swap)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_SWAP_BANK(bank_swap));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetSwapBank(FLASH_GET_ITF_INSTANCE(instance), (uint32_t)bank_swap);
  return HAL_OK;
}

/**
  * @brief  Get the FLASH OB bank swapping configuration.
  * @param  instance The FLASH instance.
  * @note   This function returns the programmed option byte swap bank setting.
  * @retval Return value can be one element of @ref hal_flash_itf_ob_bank_swap_t enumeration.
  */
hal_flash_itf_ob_bank_swap_t HAL_FLASH_ITF_OB_GetBankSwap(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return ((hal_flash_itf_ob_bank_swap_t)LL_FLASH_OB_GetSwapBank(FLASH_GET_ITF_INSTANCE(instance)));
}

/**
  * @brief  Check the FLASH OB bank swapping state.
  * @param  instance The FLASH instance.
  * @note   This function returns the current effective bank swapping status.
  * @retval Return value can be one element of @ref hal_flash_itf_ob_bank_swap_status_t enumeration.
  */
hal_flash_itf_ob_bank_swap_status_t HAL_FLASH_ITF_OB_IsBankSwapped(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return ((hal_flash_itf_ob_bank_swap_status_t)LL_FLASH_OB_IsBankSwapped(FLASH_GET_ITF_INSTANCE(instance)));
}

/**
  * @brief  Enable the FLASH OB SRAM ECC configuration.
  * @param  instance  The FLASH instance.
  * @param  sram
  *         This parameter can take one of the following values:
  *         @arg @ref HAL_FLASH_ITF_OB_SRAM2
  * @note   To configure the SRAM ECC feature, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB SRAM ECC is successfully configured.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_EnableSRAMECC(hal_flash_t instance, uint32_t sram)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM((sram & FLASH_ITF_OB_SRAM_ECC_MSK) == sram);

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  if ((sram & HAL_FLASH_ITF_OB_SRAM2) == HAL_FLASH_ITF_OB_SRAM2)
  {
    LL_FLASH_OB_EnableECCSRAM2(FLASH_GET_ITF_INSTANCE(instance));
  }

  return HAL_OK;
}

/**
  * @brief  Disable the FLASH OB SRAM ECC configuration.
  * @param  instance  The FLASH instance.
  * @param  sram
  *         This parameter can take one of the following values:
  *         @arg @ref HAL_FLASH_ITF_OB_SRAM2
  * @note   To configure the SRAM ECC feature, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB SRAM ECC is successfully configured.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_DisableSRAMECC(hal_flash_t instance, uint32_t sram)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM((sram & FLASH_ITF_OB_SRAM_ECC_MSK) == sram);

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  if ((sram & HAL_FLASH_ITF_OB_SRAM2) == HAL_FLASH_ITF_OB_SRAM2)
  {
    LL_FLASH_OB_DisableECCSRAM2(FLASH_GET_ITF_INSTANCE(instance));
  }

  return HAL_OK;
}

/**
  * @brief  Check the FLASH OB SRAM2 ECC configuration is enabled or disabled.
  * @param  instance The FLASH instance.
  * @param  sram
  *         This parameter can take one of the following values:
  *         @arg @ref HAL_FLASH_ITF_OB_SRAM2
  * @retval Return value can be one element of @ref hal_flash_itf_ob_sram_ecc_status_t enumeration.
  */
hal_flash_itf_ob_sram_ecc_status_t HAL_FLASH_ITF_OB_IsEnabledSRAMECC(hal_flash_t instance, uint32_t sram)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_OB_SRAM_ECC(sram));
  STM32_UNUSED(sram);
  return (hal_flash_itf_ob_sram_ecc_status_t)LL_FLASH_OB_IsEnabledECCSRAM2(FLASH_GET_ITF_INSTANCE(instance));
}

/**
  * @brief  Set the FLASH OB unique boot address configuration.
  * @param  instance  The FLASH instance.
  * @param  boot_addr Boot address to be configured.
  * @note   To configure the boot address, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK            FLASH OB boot address is successfully configured.
  * @retval HAL_ERROR         FLASH OB write error generated.
  * @retval HAL_INVALID_PARAM FLASH OB boot address out of bounds.
  */
hal_status_t HAL_FLASH_ITF_OB_SetBootAddr(hal_flash_t instance, uint32_t boot_addr)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

