MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash_itf.c
  if ((boot_addr < FLASH_BASE) || (boot_addr > (FLASH_BASE + FLASH_SIZE)))
  {
    return HAL_INVALID_PARAM;
  }

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetBootAddr(FLASH_GET_ITF_INSTANCE(instance), boot_addr);
  return HAL_OK;
}

/**
  * @brief  Get the FLASH OB unique boot address 0 configuration.
  * @param  instance The FLASH instance.
  * @retval Return the configured boot address.
  */
uint32_t HAL_FLASH_ITF_OB_GetBootAddr(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return LL_FLASH_OB_GetBootAddr(FLASH_GET_ITF_INSTANCE(instance));
}

/**
  * @brief  Lock FLASH OB unique boot address.
  * @param  instance  The FLASH instance.
  * @note   To configure the boot address lock, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB boot address is successfully locked.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_LockBootConfig(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_LockBootConfig(FLASH_GET_ITF_INSTANCE(instance));
  return HAL_OK;
}

/**
  * @brief  Unlock FLASH OB unique boot address.
  * @param  instance  The FLASH instance.
  * @note   To configure the boot address lock, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK    FLASH OB boot address is successfully unlocked.
  * @retval HAL_ERROR FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_UnlockBootConfig(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_UnlockBootConfig(FLASH_GET_ITF_INSTANCE(instance));
  return HAL_OK;
}

/**
  * @brief  Check if the FLASH OB unique boot address is locked or not.
  * @param  instance The FLASH instance.
  * @retval Return value can be one element of @ref hal_flash_itf_ob_boot_lock_status_t enumeration.
  */
hal_flash_itf_ob_boot_lock_status_t HAL_FLASH_ITF_OB_IsLockedBootConfig(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return (hal_flash_itf_ob_boot_lock_status_t)LL_FLASH_OB_IsLockedBootConfig(FLASH_GET_ITF_INSTANCE(instance));
}

/**
  * @brief  Set the bootloader interface configuration to the specified value.
  * @param  instance          The FLASH instance.
  * @param  bootloader_config This parameter can be any value between 0x00000000 and 0xFFFFFFFF.
  * @note   To configure the bootloader interface, the option lock bit OPTLOCK must be
  *         cleared with the call of the HAL_FLASH_ITF_OB_Unlock() function.
  * @retval HAL_OK            FLASH OB bootloader configuration is successfully configured.
  * @retval HAL_ERROR         FLASH OB write error generated.
  */
hal_status_t HAL_FLASH_ITF_OB_SetBootloaderInterfaceConfig(hal_flash_t instance, uint32_t bootloader_config)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  if (LL_FLASH_IsActiveFlag(FLASH_GET_ITF_INSTANCE(instance), \
                            (LL_FLASH_FLAG_STATUS_ALL | LL_FLASH_FLAG_ERRORS_ALL)) != 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_OB_SetBootloaderInterfaceConfig(FLASH_GET_ITF_INSTANCE(instance), bootloader_config);
  return HAL_OK;
}

/**
  * @brief  Get the bootloader interface configuration.
  * @param  instance The FLASH instance.
  * @retval Returned value can be any value between 0x00000000 and 0xFFFFFFFF.
  */
uint32_t HAL_FLASH_ITF_OB_GetBootloaderInterfaceConfig(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  return  LL_FLASH_OB_GetBootloaderInterfaceConfig(FLASH_GET_ITF_INSTANCE(instance));
}

/**
  * @}
  */

/** @addtogroup FLASH_ITF_Exported_Functions_Group3
  * @{
This subsection provides a set of functions allowing handling of the FLASH ITF interrupt subroutines:

- Call the function HAL_FLASH_ITF_IRQHandler() handle any enabled OB write interrupt and call its corresponding
  callback.

- The function HAL_FLASH_ITF_OB_ProgramCpltCallback() to be redefined within application for the OB complete write
  operation callback.

- The function HAL_FLASH_ITF_OB_ErrorCallback() to be redefined within application the OB write error operation
  callback.
  */

/**
  * @brief  Handle the FLASH ITF interrupt request.
  * @param  instance The FLASH instance.
  */
void HAL_FLASH_ITF_IRQHandler(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  uint32_t flags = LL_FLASH_READ_REG(FLASH_GET_ITF_INSTANCE(instance), SR);

  if (STM32_READ_BIT(flags, LL_FLASH_FLAG_EOP) != 0U)
  {
    LL_FLASH_ClearFlag(FLASH_GET_ITF_INSTANCE(instance), LL_FLASH_FLAG_EOP);
    LL_FLASH_DisableIT(FLASH_GET_ITF_INSTANCE(instance), (LL_FLASH_IT_EOP | LL_FLASH_IT_OPTCHANGEERR));
    HAL_FLASH_ITF_OB_ProgramCpltCallback(instance);
  }

  if (STM32_READ_BIT(flags, LL_FLASH_FLAG_OPTCHANGEERR) != 0U)
  {
    LL_FLASH_ClearFlag(FLASH_GET_ITF_INSTANCE(instance), LL_FLASH_FLAG_OPTCHANGEERR);
    LL_FLASH_DisableIT(FLASH_GET_ITF_INSTANCE(instance), (LL_FLASH_IT_EOP | LL_FLASH_IT_OPTCHANGEERR));
    HAL_FLASH_ITF_OB_ErrorCallback(instance);
  }
}

/**
  * @brief  FLASH ITF option bytes write complete callback.
  * @param  instance The FLASH instance.
  */
__WEAK void HAL_FLASH_ITF_OB_ProgramCpltCallback(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

