MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_flash_itf.c
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(instance);

  /*! WARNING: This function must not be modified, when the callback is needed, the
               HAL_FLASH_ITF_OB_ProgramCpltCallback() could be implemented in the user file */
}

/**
  * @brief  FLASH ITF option bytes write error callback.
  * @param  instance The FLASH instance.
  */
__WEAK void HAL_FLASH_ITF_OB_ErrorCallback(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(instance);

  /*! WARNING: This function must not be modified, when the callback is needed, the
               HAL_FLASH_ITF_OB_ErrorCallback() could be implemented in the user file */
}

/**
  * @}
  */

/** @addtogroup FLASH_ITF_Exported_Functions_Group4
  * @{
This subsection provides a set of functions allowing programming of the option bytes functions configuration:

- Call the function HAL_FLASH_ITF_OB_Program() to program the FLASH option bytes in polling mode.
- Call the function HAL_FLASH_ITF_OB_Program_IT() to program the FLASH option bytes in interrupt mode.
  */

/**
  * @brief  Program the FLASH ITF option bytes.
  * @param  instance  The FLASH instance.
  * @retval HAL_ERROR   Generated when an error occurred.
  * @retval HAL_TIMEOUT User timeout.
  * @retval HAL_OK      No error occurred.
  */
hal_status_t HAL_FLASH_ITF_OB_Program(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  uint32_t tick_start;

  LL_FLASH_OB_StartModification(FLASH_GET_ITF_INSTANCE(instance));

  tick_start = HAL_GetTick();

  /* Wait for BSY flag to be cleared */
  while (LL_FLASH_IsActiveFlag_BSY(FLASH_GET_ITF_INSTANCE(instance)) != 0U)
  {
    if ((HAL_GetTick() - tick_start) > FLASH_ITF_OB_TIMEOUT)
    {
      if (LL_FLASH_IsActiveFlag_BSY(FLASH_GET_ITF_INSTANCE(instance)) != 0U)
      {
        /* Timeout occurred while waiting for end of operation */
        return HAL_TIMEOUT;
      }
    }
  }

  if (LL_FLASH_ReadFlag(FLASH_GET_ITF_INSTANCE(instance), LL_FLASH_FLAG_ERRORS_ALL) != 0U)
  {
    LL_FLASH_ClearFlag(FLASH_GET_ITF_INSTANCE(instance), LL_FLASH_FLAG_ERRORS_ALL);

    return HAL_ERROR;
  }

  LL_FLASH_ClearFlag_EOP(FLASH_GET_ITF_INSTANCE(instance));

  return HAL_OK;
}

/**
  * @brief  Program the FLASH Option Bytes interface settings in interrupt mode.
  * @param  instance  Specifies the FLASH instance based on @ref hal_flash_t enumeration.
  * @retval HAL_OK    FLASH Option Bytes settings successfully programmed.
  */
hal_status_t HAL_FLASH_ITF_OB_Program_IT(hal_flash_t instance)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));

  LL_FLASH_ClearFlag_EOP(FLASH_GET_ITF_INSTANCE(instance));

  LL_FLASH_EnableIT(FLASH_GET_ITF_INSTANCE(instance), (LL_FLASH_IT_EOP | LL_FLASH_IT_OPTCHANGEERR));

  LL_FLASH_OB_StartModification(FLASH_GET_ITF_INSTANCE(instance));

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup FLASH_ITF_Exported_Functions_Group5
  * @{
This subsection provides a set of functions allowing management of privileged access level attributes:

- Call the HAL_FLASH_ITF_SetPrivAttr() function to set privilege attribute.

- Call the HAL_FLASH_ITF_GetPrivAttr() function to get privilege attribute.
  */

/**
  * @brief  Set privilege attribute.
  * @param  instance  The FLASH instance.
  * @param  item      The item attribute to be configured.
  *                   This parameter can be the following value:
  *                   @arg @ref HAL_FLASH_ITF_PRIV_ITEM_ALL
  * @param  priv_attr This parameter is an element of @ref hal_flash_itf_priv_attr_t enumeration:
  *                   @arg @ref HAL_FLASH_ITF_PRIV
  *                   @arg @ref HAL_FLASH_ITF_NPRIV
  * @retval HAL_ERROR  The function is called in unprivileged mode.
  * @retval HAL_OK     Privilege attribute has been correctly set.
  */
hal_status_t HAL_FLASH_ITF_SetPrivAttr(hal_flash_t instance, uint32_t item, hal_flash_itf_priv_attr_t priv_attr)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_PRIV_ITEM(item));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_PRIV_ATTR(priv_attr));


  if (STM32_IS_PRIVILEGED_EXECUTION() == 0U)
  {
    return HAL_ERROR;
  }

  LL_FLASH_SetPrivAttr(FLASH_GET_ITF_INSTANCE(instance), item, (uint32_t)priv_attr);

  return HAL_OK;
}

/**
  * @brief  Get privilege attribute.
  * @param  instance The FLASH instance.
  * @param  item     The item attribute to be queried.
  *                  This parameter can be the following value:
  *                  @arg @ref HAL_FLASH_ITF_PRIV_ITEM_ALL
  * @retval hal_flash_itf_priv_attr_t Returned value is an element of @ref hal_flash_itf_priv_attr_t enumeration:
  *                                   @arg @ref HAL_FLASH_ITF_PRIV
  *                                   @arg @ref HAL_FLASH_ITF_NPRIV
  */
hal_flash_itf_priv_attr_t HAL_FLASH_ITF_GetPrivAttr(hal_flash_t instance, uint32_t item)
{
  ASSERT_DBG_PARAM(IS_FLASH_INSTANCE(FLASH_GET_ITF_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_FLASH_ITF_PRIV_ITEM(item));

  return ((hal_flash_itf_priv_attr_t)LL_FLASH_GetPrivAttr(FLASH_GET_ITF_INSTANCE(instance), item));
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_FLASH_MODULE */
#endif /* FLASH */

/**
  * @}
  */
